// спрашиваю у пользователя количество мегабайтов
const megabites = prompt("Введіть кількість мегабайтів:");

// проверяю заданное число мегабайтов  и считаю байты
if (!isNaN(megabites) && megabites !== null && megabites.trim() !== "") {
  const bites = Number(megabites) * 1048576; // количество байтев в килобайтах и взводим в степень т к в мегабайте 1024 КБ

  // вывожу результат
  alert(`У ${megabites} мегабатах ${bites} байтів.`); // задаю прееменную что читала только числа без букв и символов
} else {
  alert("Будь ласка, введіть коректну кількість мегабайтів.");
}
