// 3 Завдання


function askForNumber() {
    let attempts = 0; // Лічильник спроб
    while (attempts < 10) { // Максимум 10 ітерацій
        let userInput = prompt("Введіть число більше 100:");
        let numb = Number(userInput); // Перетворюємо введене значення на число

        
        if (numb > 100) { // Перевіряємо, чи введене число більше 100
            console.log("Останнє введене число:", numb);
            return; // Завершуємо функцію, якщо число більше 100
        } else {
            alert("Число повинно бути більше 100. Спробуйте ще раз.");
        }
        
        attempts++; // Збільшуємо лічильник спроб
    }

    console.log("Досягнуто максимальної кількості спроб.");
}

askForNumber(); // Викликаємо функцію